Repository: grm34/PyZenMaxBuilder
Catalog: locales/*/LC_MESSAGES/ZenMaxBuilder.po
Languages: fr

source: cloning AnyKernel in android...
fr: clonage de AnyKernel dans android...

source: failed to clone AnyKernel!
fr: impossible de cloner AnyKernel!

source: cloning {toolchain} in android/toolchains...
fr: clonage de {toolchain} dans android/toolchains...

source: failed to clone {toolchain}!
fr: impossible de cloner {toolchain}!

source: downloading ZipSigner in android/tools...
fr: téléchargement de Zipsigner dans android/tools...

source: failed to download Zipsigner!
fr: impossible de télécharger Zipsigner!

source: successfully compiled !
fr: compilation terminée !

source: make clean and MrProper ({version})...
fr: make clean et MrProper ({version})...

source: cleaning {out}...
fr: nettoyage de {out}...

source: successfully cleaned !
fr: nettoyage terminé !

source: Select the desired mode
fr: Sélectionnez le mode désiré

source: Build new android kernel
fr: Compiler un nouveau kernel

source: Create/edit with menuconfig
fr: Créer/éditer avec menuconfig

source: Create flashable zip
fr: Créer un zip flashable

source: Sign flashable zip
fr: Signer un zip flashable

source: Run make clean/mrproper
fr: Lancer make clean/mrproper

source: Return to terminal
fr: Retour au terminal

source: Do you wish to save copy of modified {config}
fr: Voulez-vous sauvegarder une copie de {config}

source: Enter defconfig name (e.q. new_defconfig)
fr: Sauvegarder le defconfig sous (ex: nouveau_defconfig)

source: Enter device codename (e.q. ASUS_X00TD)
fr: Saisissez le code de l'appareil (ex: ASUS_X00TD)

source: Select the compiler to use
fr: Sélectionnez le compiler à utiliser

source: Select the defconfig to use
fr: Sélectionnez le defconfig à utiliser

source: Select the kernel image to zip
fr: Sélectionnez l'image du kernel à zipper

source: Select the zip(s) to sign
fr: Sélectionnez le(s) zip(s) à signer

source: Do you wish to edit {defconfig} with menuconfig
fr: Voulez-vous éditer {defconfig} avec menuconfig

source: Do you wish to use all cores ➡ {proc}
fr: Voulez-vous utiliser tous les cores ➡ {proc}

source: Enter the amount of CPU cores to use
fr: Entrez le nombre de cores CPU à utiliser

source: Do you wish to make clean & mrproper ➡ {kv}
fr: Voulez-vous exécuter make clean & mrproper ➡ {kv}

source: Do you wish to start new build ➡ {team}{codename}-{kv}
fr: Voulez-vous lancer la compilation ➡ {team}{codename}-{kv}

source: Do you wish to zip selected kernel image
fr: Voulez-vous zipper l'image sélectionnée

source: Do you wish to sign selected kernel(s)
fr: Voulez-vous signer le(s) kernel(s) sélectionné(s)

source: Invalid defconfig name: {response} (e.q., new_defconfig)
fr: Nom invalide: {response} (ex: nouveau_defconfig)

source: Invalid device codename: {response} (e.q., ASUS_X00TD)
fr: Codename invalide: {response} (ex: ASUS_X00TD)

source: Invalid entry: {response} ﴾{proc} ➟ {cores} CORE(s)﴿
fr: Entrée invalide: {response} ﴾{proc} ➟ {cores} CORE(s)﴿

source: You must select at least one element...
fr: Vous devez sélectionner au moins un élément...

source: Arrow keys to navigate ↓ Space to select options ↔ Enter to confirm ⇲
fr: Flèches pour naviguer ↓ Espace pour sélectionner ↔ Entrée pour confirmer ⇲

source: [kernel] {path} not found !
fr: [kernel] {path} non trouvé !

source: use --kernel-folder option or edit app/settings.py
fr: utilisez l'option --kernel-folder ou éditez app/settings.py

source: [kernel] {path} is not an android kernel tree !
fr: [kernel] {path} n'est pas un kernel android !

source: [defconfig] {path} not found !
fr: [defconfig] {path} non trouvé !

source: use --defconfig-folder option or edit app/settings.py
fr: utilisez l'option --defconfig-folder ou éditez app/settings.py

source: [out] {path} not found !
fr: [out] {path} non trouvé !

source: use --out-folder option or edit app/settings.py
fr: utilisez l'option --out-folder ou éditez app/settings.py

source: [kernel img] {path} not found !
fr: [kernel img] {path} non trouvé !

source: [zip] {path} not found !
fr: [zip] {path} non trouvé !

source: use --zip-folder option or edit app/settings.py
fr: utilisez l'option --zip-folder ou éditez app/settings.py

source: no defconfig files found in: {path}
fr: aucun defconfig dans: {path}

source: Get android devices list...
fr: Obtention de la liste des appareils android...

source: failed to get android devices list
fr: impossible d'obtenir la liste des appareils

source: use --codename option or edit app/settings.py
fr: utilisez l'option --codename ou éditez app/settings.py

source: no kernel image found in: {path}
fr: aucune image kernel dans: {path}

source: use --img-folder option or edit app/settings.py
fr: utilisez l'option --img-folder ou éditez app/settings.py

source: failed to get processor
fr: impossible de détecter le processeur

source: failed to get CPU cores
fr: impossible de détecter les cores du CPU

source: failed to make kernel version
fr: impossible d'obtenir la version du kernel

source: no flashable zip found in: {path}
fr: aucun zip flashable dans: {path}

source: successfully saved
fr: sauvegarde réussie

source: saving build logs to android/logs...
fr: sauvegarde des logs dans android/logs...

source: checking current kernel version...
fr: vérification de la version du kernel...

source: configuring anykernel...
fr: configuration de anykernel...

source: copy kernel image to AnyKernel...
fr: copie de l'image du kernel vers AnyKernel...

source: creating {build}.zip...
fr: création de {build}.zip...

source: successfully zipped !
fr: archivage zip terminé !

source: AnyKernel folder cleaned !
fr: Dossier AnyKernel nettoyé !

source: signing {zip}.zip...
fr: signature de {zip}.zip...

source: successfully signed !
fr: signature terminée !
